# CurveWallOffsetRoofs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveWallOffsetRoofs Property
ParameterTypeId Class See Also
---
"Overhang"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveWallOffsetRoofs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveWallOffsetRoofs As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveWallOffsetRoofs {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace